"use strict"; //запись для использования строгого стиля кода

/** 
 * Операторы в JS
 */

console.log('arr' + " - object");
console.log(4 + "5");
// console.log(4 + +"5");

let incr = 10,
    decr = 10;

/**
 * Префиксная форма записи инкремента и декремента
 */
// ++incr;
// --decr;

/**
 * Постфиксная форма записи инкремента и декремента
 */
// incr++;
// decr--;

// console.log(incr++);
// console.log(decr--);


/** 
 * Остаток от деления - %
 */
// console.log(5%2);


/** 
 * Оператор сравнения ==
 */
console.log(2*4 == 8);